#### GeoCoordinateSystemDefinition Property

---

|  |
| --- |
| SiteLocation Class   See Also |

The XML string which describes the geographic coordinate system.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public string GeoCoordinateSystemDefinition { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property GeoCoordinateSystemDefinition As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ GeoCoordinateSystemDefinition { 	String^ get (); } ``` |

# Remarks

If the site does not have a geographic coordinate system, it returns an empty string for this property.

# See Also

SiteLocation Class

Autodesk.Revit.DB Namespace

#### MoveAdaptiveComponentInstance Method

---

|  |
| --- |
| AdaptiveComponentInstanceUtils Class   See Also |

Moves Adaptive Component Instance by the specified transformation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static void MoveAdaptiveComponentInstance( 	FamilyInstance famInst, 	Transform trf, 	bool unHost ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub MoveAdaptiveComponentInstance ( _ 	famInst As FamilyInstance, _ 	trf As Transform, _ 	unHost As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void MoveAdaptiveComponentInstance( 	FamilyInstance^ famInst,  	Transform^ trf,  	bool unHost ) ``` |

#### Parameters

famInst
:   Type:  Autodesk.Revit.DB FamilyInstance
     The FamilyInstance

trf
:   Type:  Autodesk.Revit.DB Transform
     The Transformation

unHost
:   Type:  System Boolean
     True if the move should disassociate the Point Element Refs from their hosts. False if the Point Element Refs remain hosted.

# Remarks

This method will attempt a rigid body motion of all the individual references and hence the instance itself. However if unHost parameter is 'false' and any of the instance's references are hosted to any geometry, then those references will move within the constraints. The instance then adapts to where its references are moved to.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | trf is not a rigid body transformation. |
| Autodesk.Revit.Exceptions InvalidOperationException | Unable to move the adaptive component instance. |

# See Also

AdaptiveComponentInstanceUtils Class

Autodesk.Revit.DB Namespace

#### VariesAcrossGroups Property

---

|  |
| --- |
| InternalDefinition Class   See Also |

Whether or not the parameter values can vary across group members.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool VariesAcrossGroups { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property VariesAcrossGroups As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool VariesAcrossGroups { 	bool get (); } ``` |

#### Field Value

True if the values of this parameter can vary across the related members of group instances. False if the values will be consistent across the related members in group instances.

# See Also

InternalDefinition Class

Autodesk.Revit.DB Namespace

#### CannotDrawRoofError Property

---

|  |
| --- |
| BuiltInFailures CreationFailures Class   See Also |

Can't make roof.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotDrawRoofError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotDrawRoofError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotDrawRoofError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CreationFailures Class

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| ExportPDFSettings Class   See Also |

Returns an new created ExportPDFSettings element in the document with specified settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public static ExportPDFSettings Create( 	Document document, 	string name, 	PDFExportOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	name As String, _ 	options As PDFExportOptions _ ) As ExportPDFSettings ``` |

| Visual C++ |
| --- |
| ``` public: static ExportPDFSettings^ Create( 	Document^ document,  	String^ name,  	PDFExportOptions^ options ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     Document where the settings will be created.

name
:   Type:  System String
     Name to the settings.

options
:   Type:  Autodesk.Revit.DB PDFExportOptions
     The options to be set.

#### Return Value

New instance of ExportPDFSettings just created in the document.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | name is an empty string or contains only whitespace. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- Setting name. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

ExportPDFSettings Class

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| RevisionCloud Class   Example   See Also |

Creates a new RevisionCloud in the model.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static RevisionCloud Create( 	Document document, 	View view, 	ElementId revisionId, 	IList<Curve> curves ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	view As View, _ 	revisionId As ElementId, _ 	curves As IList(Of Curve) _ ) As RevisionCloud ``` |

| Visual C++ |
| --- |
| ``` public: static RevisionCloud^ Create( 	Document^ document,  	View^ view,  	ElementId^ revisionId,  	IList<Curve^>^ curves ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document in which the RevisionCloud should be created.

view
:   Type:  Autodesk.Revit.DB View
     The View in which the RevisionCloud should appear.

revisionId
:   Type:  Autodesk.Revit.DB ElementId
     The Revision to associate with the new RevisionCloud.

curves
:   Type:  System.Collections.Generic IList   Curve
     The curves that will form the RevisionCloud's sketch.

#### Return Value

The newly created RevisionCloud.

# Remarks

Creates a new RevisionCloud in the specified View. The new RevisionCloud will be associated with the specified Revision. RevisionClouds can only be created if the Revision has not yet been issued.

RevisionClouds can be created in most graphical Views, excepting 3D views and graphical column schedules. Unlike most other Elements, RevisionClouds can be created directly on a ViewSheet.

RevisionClouds are created based on a series of sketched curves. There is no requirement that the curves form closed loops and self-intersections are also permitted. The curves will be automatically projected onto the appropriate plane for the View. The list of curves cannot be empty and any lines cannot be perpendicular to the View's plane. If the View is a model View, the coordinates specified for the curves will be interpreted in model space. If the View is a non-model View (such as a ViewSheet) then the coordinates will be interpreted in the View's space.

The cloud graphics will be attached to the curves under the assumption that each curve is oriented in a clockwise direction. For lines, this means that the outside of the cloud is in the direction of the line's normal vector within the View's plane. Any closed loops should therefore be oriented clockwise to create the typical cloud shape.

# Examples

 Copy  C#

```
private void CreateRevisionCloudInActiveView(Document document, Revision revision, IList<Curve> curves)
{
    using (Transaction newRevisionCloud = new Transaction(document, "Create Revision Cloud"))
    {
        newRevisionCloud.Start();
        // Can only create revision cloud for revision that is not issued
        if (revision.Issued == false)
        {
            RevisionCloud.Create(document, document.ActiveView, revision.Id, curves);
            newRevisionCloud.Commit();
        }
        else
        {
            newRevisionCloud.RollBack();
        }
    }
}
```

 Copy  VB.NET

```
Private Sub CreateRevisionCloudInActiveView(document As Document, revision As Revision, curves As IList(Of Curve))
    Using newRevisionCloud As New Transaction(document, "Create Revision Cloud")
        newRevisionCloud.Start()
        ' Can only create revision cloud for revision that is not issued
        If revision.Issued = False Then
            RevisionCloud.Create(document, document.ActiveView, revision.Id, curves)
            newRevisionCloud.Commit()
        Else
            newRevisionCloud.RollBack()
        End If
    End Using
End Sub
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | document is not a project document. -or- revisionId is not a valid Revision. -or- This operation cannot be performed because revisionId is an issued Revision. -or- view is not a View that can support RevisionClouds. -or- The provided Curves curves cannot be used as the basis for a RevisionCloud. Either the list is empty or one or more of the Curves could not be projected onto the View's plane. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RevisionCloud Class

Autodesk.Revit.DB Namespace

#### DecalHeight Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Height"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DecalHeight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DecalHeight As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DecalHeight { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetDocument Method

---

|  |
| --- |
| GeometryInstance Class   See Also |

Gets the document that contains the symbol of this instance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public Document GetDocument() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetDocument As Document ``` |

| Visual C++ |
| --- |
| ``` public: Document^ GetDocument() ``` |

#### Return Value

Returns the document that contains the symbol of this instance.

# See Also

GeometryInstance Class

Autodesk.Revit.DB Namespace

#### GetRenderingQualitySettings Method

---

|  |
| --- |
| RenderingSettings Class   See Also |

Returns an object that represents the rendering quality settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public RenderingQualitySettings GetRenderingQualitySettings() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRenderingQualitySettings As RenderingQualitySettings ``` |

| Visual C++ |
| --- |
| ``` public: RenderingQualitySettings^ GetRenderingQualitySettings() ``` |

#### Return Value

The rendering quality settings.

# See Also

RenderingSettings Class

Autodesk.Revit.DB Namespace

#### LoadLinearForceFx2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Fx 2"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadLinearForceFx2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadLinearForceFx2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadLinearForceFx2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AssociatedBuildingPadId Property

---

|  |
| --- |
| TopographySurface Class   See Also |

The element id of the building pad which causes this topography surface to be formed.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public ElementId AssociatedBuildingPadId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property AssociatedBuildingPadId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ AssociatedBuildingPadId { 	ElementId^ get (); } ``` |

# Remarks

InvalidElementId returned signals that there is no associated building pad.

# See Also

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace

#### ImportSymbolBaseLevelInvalid Property

---

|  |
| --- |
| BuiltInFailures ImportFailures Class   See Also |

An import instance has become invalid. The host work plane of the import can no longer be used. Click "Rehost" to maintain the position of the import and rehost its work plane to the lowest level.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ImportSymbolBaseLevelInvalid { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ImportSymbolBaseLevelInvalid As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ImportSymbolBaseLevelInvalid { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ImportFailures Class

Autodesk.Revit.DB Namespace

#### TotalCoefficient Property

---

|  |
| --- |
| MEPSection Class   See Also |

The loss coefficient of the section.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double TotalCoefficient { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property TotalCoefficient As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double TotalCoefficient { 	double get (); } ``` |

# Remarks

It's total of all fittings and segments. Coefficient is a number. The unit type is UT\_Number.

# See Also

MEPSection Class

Autodesk.Revit.DB.Mechanical Namespace

#### IsResourceWellFormed Method

---

|  |
| --- |
| IExternalResourceServer Interface   See Also |

Implement this method to check whether the given ExternalResourceReference is formatted correctly for this server.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` bool IsResourceWellFormed( 	ExternalResourceReference extRef ) ``` |

| Visual Basic |
| --- |
| ``` Function IsResourceWellFormed ( _ 	extRef As ExternalResourceReference _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` bool IsResourceWellFormed( 	ExternalResourceReference^ extRef ) ``` |

#### Parameters

extRef
:   Type:  Autodesk.Revit.DB ExternalResourceReference
     The ExternalResourceReference to check.

#### Return Value

True if the ExternalResourceReference represents a well-formed resource. False otherwise.

# Remarks

Different servers will have different requirements.

A server which loads references from a website might require that the reference map contain a key called "URL" and a value that is a valid URL.

A server which loads references from a network drive might require a key called "Drive" with a value that represents a drive name, plus a key called "Path" with a value that corresponds to a path relative to the root of the drive.

This function should not check that the resource exists on the server. It should only check that the resource is formatted correctly.

# See Also

IExternalResourceServer Interface

Autodesk.Revit.DB Namespace

#### ExportObjectData Property

---

|  |
| --- |
| DWFExportOptions Class   See Also |

Whether to include properties associated with elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool ExportObjectData { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ExportObjectData As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ExportObjectData { 	bool get (); 	void set (bool value); } ``` |

# Remarks

ExportObjectData must be enabled (true) in order to also enable exporting rooms and areas (ExportingAreas). If ExportObjectData is disabled, the ExportingAreas property will be ignored.

# See Also

DWFExportOptions Class

Autodesk.Revit.DB Namespace

#### TransactionFailedWarn Property

---

|  |
| --- |
| BuiltInFailures GeneralFailures Class   See Also |

[Description]

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId TransactionFailedWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TransactionFailedWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ TransactionFailedWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GeneralFailures Class

Autodesk.Revit.DB Namespace

#### ExternalResourceType Property

---

|  |
| --- |
| ImageType Class   See Also |

The type of external resources that represents images.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public static ExternalResourceType ExternalResourceType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ExternalResourceType As ExternalResourceType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ExternalResourceType^ ExternalResourceType { 	ExternalResourceType^ get (); } ``` |

# See Also

ImageType Class

Autodesk.Revit.DB Namespace

#### GetRowHeight Method

---

|  |
| --- |
| TableSectionData Class   See Also |

Returns a row's height in feet

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double GetRowHeight( 	int nRow ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRowHeight ( _ 	nRow As Integer _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetRowHeight( 	int nRow ) ``` |

#### Parameters

nRow
:   Type:  System Int32

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given row number nRow is invalid. |

# See Also

TableSectionData Class

Autodesk.Revit.DB Namespace

#### SpotElevationLostEdgeReferences Property

---

|  |
| --- |
| BuiltInFailures DimensionFailures Class   See Also |

Some Spot Dimensions lost their References. Those Spot Dimensions will be deleted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SpotElevationLostEdgeReferences { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpotElevationLostEdgeReferences As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SpotElevationLostEdgeReferences { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DimensionFailures Class

Autodesk.Revit.DB Namespace

#### Create Method (Document, ElementId, ElementId, ElementId, IList(XYZ))

---

|  |
| --- |
| FlexPipe Class   See Also |

Creates a new flexible pipe into the document, using a point array and flex pipe type.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static FlexPipe Create( 	Document document, 	ElementId systemTypeId, 	ElementId pipeTypeId, 	ElementId levelId, 	IList<XYZ> points ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	systemTypeId As ElementId, _ 	pipeTypeId As ElementId, _ 	levelId As ElementId, _ 	points As IList(Of XYZ) _ ) As FlexPipe ``` |

| Visual C++ |
| --- |
| ``` public: static FlexPipe^ Create( 	Document^ document,  	ElementId^ systemTypeId,  	ElementId^ pipeTypeId,  	ElementId^ levelId,  	IList<XYZ^>^ points ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

systemTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the piping system type.

pipeTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the flexible pipe.

levelId
:   Type:  Autodesk.Revit.DB ElementId
     The level id for the flexible pipe.

points
:   Type:  System.Collections.Generic IList   XYZ
     The point array indicating the path of the flexible pipe, including the end point.

#### Return Value

If creation was successful then a new flexible pipe is returned, otherwise an exception with failure information will be thrown.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The systemTypeId is not valid piping system type. -or- The type pipeTypeId is not valid flexible pipe type. -or- The ElementId levelId is not a Level. -or- The valid number of points is less than two. In order to create a flex curve, at least two points are required. Note the duplicate points don't take into account. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also

FlexPipe Class

Create Overload

Autodesk.Revit.DB.Plumbing Namespace

#### ProjectLocations Property

---

|  |
| --- |
| Document Class   See Also |

Retrieve all the project locations associated with this project

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ProjectLocationSet ProjectLocations { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ProjectLocations As ProjectLocationSet 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ProjectLocationSet^ ProjectLocations { 	ProjectLocationSet^ get (); } ``` |

# Remarks

This property returns all the locations of the project. A project can have one site location but many project locations within that site. Each project location object is an offset and rotation from the site location.

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### ClearWebHeight Property

---

|  |
| --- |
| StructuralSectionCParallelFlange Class   See Also |

Detailing depth between the web toes of the fillets, in.(mm)

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public double ClearWebHeight { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ClearWebHeight As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double ClearWebHeight { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionCParallelFlange Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### memberTypeKey Property

---

|  |
| --- |
| TrussMemberInfo Class   See Also |

Kind of the member in the truss.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public TrussMemberType memberTypeKey { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property memberTypeKey As TrussMemberType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property TrussMemberType memberTypeKey { 	TrussMemberType get (); 	void set (TrussMemberType value); } ``` |

# See Also

TrussMemberInfo Class

Autodesk.Revit.DB.Structure Namespace

#### DimLeaderArrowhead Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Tick Mark"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DimLeaderArrowhead { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DimLeaderArrowhead As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DimLeaderArrowhead { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SurfaceRotation Property

---

|  |
| --- |
| AdvancedMetal Class   See Also |

The property labeled "Rotation" from the "AdvancedMetal" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string SurfaceRotation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SurfaceRotation As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ SurfaceRotation { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble". This property allows a connected asset.

# See Also

AdvancedMetal Class

Autodesk.Revit.DB.Visual Namespace

#### SetNamingRule Method

---

|  |
| --- |
| PDFExportOptions Class   See Also |

Sets the naming rule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void SetNamingRule( 	IList<TableCellCombinedParameterData> namingRule ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetNamingRule ( _ 	namingRule As IList(Of TableCellCombinedParameterData) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetNamingRule( 	IList<TableCellCombinedParameterData^>^ namingRule ) ``` |

#### Parameters

namingRule
:   Type:  System.Collections.Generic IList   TableCellCombinedParameterData
     The naming rule.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The namingRule is empty or contains illegal characters. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PDFExportOptions Class

Autodesk.Revit.DB Namespace

#### SetExecutionOrder Method

---

|  |
| --- |
| UpdaterRegistry Class   See Also |

Forces execution order between two updaters Execution order: first before second

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static void SetExecutionOrder( 	UpdaterId first, 	UpdaterId second ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub SetExecutionOrder ( _ 	first As UpdaterId, _ 	second As UpdaterId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void SetExecutionOrder( 	UpdaterId^ first,  	UpdaterId^ second ) ``` |

#### Parameters

first
:   Type:  Autodesk.Revit.DB UpdaterId
     Id of first Updater

second
:   Type:  Autodesk.Revit.DB UpdaterId
     Id of second Updater

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | One or both inputs are not valid UpdaterIds -or- One or both of the Updaters are not registered -or- first and second are the same id |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | The updaters do not report the same ChangePriority |

# See Also

UpdaterRegistry Class

Autodesk.Revit.DB Namespace

#### GetRepresentations Method

---

|  |
| --- |
| IFCGeometryInfo Class   See Also |

Gets the representation handles created representing the processed geometry and stored in this object.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ICollection<IFCAnyHandle> GetRepresentations() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRepresentations As ICollection(Of IFCAnyHandle) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<IFCAnyHandle^>^ GetRepresentations() ``` |

#### Return Value

The collection of representation handles.

# See Also

IFCGeometryInfo Class

Autodesk.Revit.DB.IFC Namespace

#### Parameter Property (Definition)

---

|  |
| --- |
| Element Class   See Also |

Retrieves a parameter from the element based on its definition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Parameter this[ 	Definition definition ] { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Parameter ( _ 	definition As Definition _ ) As Parameter 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Parameter^ Parameter[Definition^ definition] { 	Parameter^ get (Definition^ definition); } ``` |

#### Parameters

definition
:   Type:  Autodesk.Revit.DB Definition
     The internal or external definition of the parameter.

# Remarks

Parameters are a generic form of data storage within elements. The parameters are visible through the Autodesk Revit user interface in the Element Properties dialog. An element can only have one instance of a parameter with a specific definition. By using this method you can retrieve that parameter based on definition.

# See Also

Element Class

Parameter Overload

Autodesk.Revit.DB Namespace

#### GetConstraints Method

---

|  |
| --- |
| RebarShapeSegment Class   See Also |

Retrieve the list of constraints associated with this segment.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public IList<RebarShapeConstraint> GetConstraints() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetConstraints As IList(Of RebarShapeConstraint) ``` |

| Visual C++ |
| --- |
| ``` public: IList<RebarShapeConstraint^>^ GetConstraints() ``` |

#### Return Value

The list of constraints.

# See Also

RebarShapeSegment Class

Autodesk.Revit.DB.Structure Namespace

#### Clear Method

---

|  |
| --- |
| ExportFontTable Class   See Also |

Removes all contents stored in the table.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: void Clear() ``` |

# See Also

ExportFontTable Class

Autodesk.Revit.DB Namespace

#### GetPlane Method

---

|  |
| --- |
| CurveLoop Class   See Also |

Gets the plane of the curve loop, if it is planar.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public Plane GetPlane() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPlane As Plane ``` |

| Visual C++ |
| --- |
| ``` public: Plane^ GetPlane() ``` |

#### Return Value

The plane of the curve loop.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The curve loop does not lie in a single plane. |

# See Also

CurveLoop Class

Autodesk.Revit.DB Namespace

#### RevealHiddenElements Property

---

|  |
| --- |
| TemporaryViewModes Class   See Also |

The current state of the RevealHiddenElements mode in the associated view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016 Subscription Update

# Syntax

| C# |
| --- |
| ``` public bool RevealHiddenElements { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property RevealHiddenElements As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool RevealHiddenElements { 	bool get (); 	void set (bool value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The RevealHiddenElements mode is either disabled or inapplicable in the associated view. |

# See Also

TemporaryViewModes Class

Autodesk.Revit.DB Namespace

#### EndJoinCutback Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"End Join Cutback"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId EndJoinCutback { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property EndJoinCutback As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ EndJoinCutback { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| RebarBarType Class   See Also |

Creates a new RebarBarType object

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static RebarBarType Create( 	Document ADoc ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	ADoc As Document _ ) As RebarBarType ``` |

| Visual C++ |
| --- |
| ``` public: static RebarBarType^ Create( 	Document^ ADoc ) ``` |

#### Parameters

ADoc
:   Type:  Autodesk.Revit.DB Document

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also

RebarBarType Class

Autodesk.Revit.DB.Structure Namespace

#### Name Property

---

|  |
| --- |
| ModuleSettings Class   See Also |

The module name.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public string Name { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Name As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Name { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ModuleSettings Class

Autodesk.Revit.DB.Macros Namespace

#### StoryAboveMoved Property

---

|  |
| --- |
| BuiltInFailures LevelFailures Class   See Also |

The level set as the Story Above for these levels has moved below these levels. This change will cause these levels to revert to the default Story Above.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId StoryAboveMoved { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StoryAboveMoved As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ StoryAboveMoved { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures LevelFailures Class

Autodesk.Revit.DB Namespace

#### ExternalResourceUIBrowseResultType Enumeration

---

|  |
| --- |
| See Also |

Describes the type of external resource browsing result.

Describes the type of external resource browsing result.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public enum ExternalResourceUIBrowseResultType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ExternalResourceUIBrowseResultType ``` |

| Visual C++ |
| --- |
| ``` public enum class ExternalResourceUIBrowseResultType ``` |

# Members

| Member name | Description |
| --- | --- |
| Success | There is no predefined error happened during this browse operation. The DB server can store any errors itself in this case. |
| FolderNotFound | The specified external resource folder cannot be found by external resource server. |
| ResourceNotFound | The specified external resource cannot be found by external resource server. |

# Remarks

This enum is used to describe the type of external resources browsing operation result ( the browsing operation include list folders and resources of an external server or a folder, or open an external resource in browsing dialog.) The meaning of each enum value:

* There is no predefined error happened during this browse operation. The DB server can store any errors itself in this case.
* FolderNotFound means the external resource folder want to browse could not be founded in external server.
* ResourceNotFound means the external resource want to open could not be founded in external server.

# See Also

Autodesk.Revit.DB Namespace

#### FileImportedEventArgs Class

---

|  |
| --- |
| Members   See Also |

The event arguments used by the FileImported event.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public class FileImportedEventArgs : RevitAPIPostDocEventArgs ``` |

| Visual Basic |
| --- |
| ``` Public Class FileImportedEventArgs _ 	Inherits RevitAPIPostDocEventArgs ``` |

| Visual C++ |
| --- |
| ``` public ref class FileImportedEventArgs : public RevitAPIPostDocEventArgs ``` |

# Inheritance Hierarchy

System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitAPIEventArgs
  Autodesk.Revit.DB.Events RevitAPIPostEventArgs
  Autodesk.Revit.DB.Events RevitAPIPostDocEventArgs
  Autodesk.Revit.DB.Events FileImportedEventArgs

# See Also

FileImportedEventArgs Members

Autodesk.Revit.DB.Events Namespace

#### RbsPipeTypeParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Pipe Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsPipeTypeParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsPipeTypeParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsPipeTypeParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FamilyParameterSet Constructor

---

|  |
| --- |
| FamilyParameterSet Class   See Also |

Initializes a new instance of the  FamilyParameterSet  class

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FamilyParameterSet() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: FamilyParameterSet() ``` |

# See Also

FamilyParameterSet Class

Autodesk.Revit.DB Namespace

#### FtOfWater Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol FT, indicating unit Feet of water (39.2 Â°F).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FtOfWater { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FtOfWater As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FtOfWater { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### RbsElecCircuitWireNumRunsParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"# of Runs"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecCircuitWireNumRunsParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecCircuitWireNumRunsParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecCircuitWireNumRunsParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### BadReferenceToSecondaryWarn Property

---

|  |
| --- |
| BuiltInFailures DesignOptionFailures Class   See Also |

No element in a secondary Option can be referenced by an element outside that Option.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BadReferenceToSecondaryWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BadReferenceToSecondaryWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BadReferenceToSecondaryWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DesignOptionFailures Class

Autodesk.Revit.DB Namespace

#### SetThermalProperties Method

---

|  |
| --- |
| FamilySymbol Class   See Also |

Sets the thermal properties for the given FamilySymbol.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetThermalProperties( 	FamilyThermalProperties thermalProperties ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetThermalProperties ( _ 	thermalProperties As FamilyThermalProperties _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetThermalProperties( 	FamilyThermalProperties^ thermalProperties ) ``` |

#### Parameters

thermalProperties
:   Type:  Autodesk.Revit.DB FamilyThermalProperties
     The new thermal properties. If    a null reference (  Nothing  in Visual Basic)  , this unsets custom thermal properties for this FamilySymbol.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The thermal properties are not valid for assignment. |
| Autodesk.Revit.Exceptions InvalidOperationException | This FamilySymbol does not contain thermal properties. |

# See Also

FamilySymbol Class

Autodesk.Revit.DB Namespace

#### FloorAttrDefaultThicknessParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Default Thickness"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FloorAttrDefaultThicknessParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FloorAttrDefaultThicknessParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FloorAttrDefaultThicknessParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ExportLayerInfo Class

---

|  |
| --- |
| Members   Example   See Also |

A value used to represent the info stored in the  ExportLayerTable  .

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class ExportLayerInfo : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ExportLayerInfo _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ExportLayerInfo : IDisposable ``` |

# Examples

 Copy  C#

```
public bool ExportDWGModifyLayerTable(Document document, View view)
{
    bool exported = false;
    IList<string> setupNames = BaseExportOptions.GetPredefinedSetupNames(document);
    if (setupNames.Count > 0)
    {
        // Get the export options for the first predefined setup
        DWGExportOptions dwgOptions = DWGExportOptions.GetPredefinedOptions(document, setupNames[0]);

        // Get the export layer table
        ExportLayerTable layerTable = dwgOptions.GetExportLayerTable();

        // Find the first mapping for the Ceilings category
        string category = "Ceilings";
        ExportLayerKey targetKey = layerTable.GetKeys().First<ExportLayerKey>(layerKey => layerKey.CategoryName == category);
        ExportLayerInfo targetInfo = layerTable[targetKey];

        // change the color name and cut color number for this mapping
        targetInfo.ColorName = "31";
        targetInfo.CutColorNumber = 31;

        // Set the change back to the map
        layerTable[targetKey] = targetInfo;

        // Set the modified table back to the options
        dwgOptions.SetExportLayerTable(layerTable);

        ICollection<ElementId> views = new List<ElementId>();
        views.Add(view.Id);

        exported = document.Export(Path.GetDirectoryName(document.PathName),
            Path.GetFileNameWithoutExtension(document.PathName), views, dwgOptions);
    }

    return exported;
}
```

 Copy  VB.NET

```
Public Function ExportDWGModifyLayerTable(document As Document, view As View) As Boolean
    Dim exported As Boolean = False
    Dim setupNames As IList(Of String) = BaseExportOptions.GetPredefinedSetupNames(document)
    If setupNames.Count > 0 Then
        ' Get the export options for the first predefined setup
        Dim dwgOptions As DWGExportOptions = DWGExportOptions.GetPredefinedOptions(document, setupNames(0))

        ' Get the export layer table
        Dim layerTable As ExportLayerTable = dwgOptions.GetExportLayerTable()

        ' Find the first mapping for the Ceilings category
        Dim category As String = "Ceilings"
        Dim targetKey As ExportLayerKey = layerTable.GetKeys().First(Function(layerKey) layerKey.CategoryName = category)
        Dim targetInfo As ExportLayerInfo = layerTable(targetKey)

        ' change the color name and cut color number for this mapping
        targetInfo.ColorName = "31"
        targetInfo.CutColorNumber = 31

        ' Set the change back to the map
        layerTable(targetKey) = targetInfo

        ' Set the modified table back to the options
        dwgOptions.SetExportLayerTable(layerTable)

        Dim views As ICollection(Of ElementId) = New List(Of ElementId)()
        views.Add(view.Id)

        exported = document.Export(Path.GetDirectoryName(document.PathName), Path.GetFileNameWithoutExtension(document.PathName), views, dwgOptions)
    End If

    Return exported
End Function
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ExportLayerInfo

# See Also

ExportLayerInfo Members

Autodesk.Revit.DB Namespace

#### CreateGreaterOrEqualRule Method (ElementId, ElementId)

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

Creates a filter rule that determines whether ElementId values from the document are greater than or equal to a certain value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static FilterRule CreateGreaterOrEqualRule( 	ElementId parameter, 	ElementId value ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateGreaterOrEqualRule ( _ 	parameter As ElementId, _ 	value As ElementId _ ) As FilterRule ``` |

| Visual C++ |
| --- |
| ``` public: static FilterRule^ CreateGreaterOrEqualRule( 	ElementId^ parameter,  	ElementId^ value ) ``` |

#### Parameters

parameter
:   Type:  Autodesk.Revit.DB ElementId
     An ElementId-typed parameter used to get values from the document for a given element.

value
:   Type:  Autodesk.Revit.DB ElementId
     The user-supplied value against which values from the document will be compared.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ParameterFilterRuleFactory Class

CreateGreaterOrEqualRule Overload

Autodesk.Revit.DB Namespace

#### Ampacity Property

---

|  |
| --- |
| WireSize Class   See Also |

Get ampacity which be used for specifying size, the unit is ampere.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public long Ampacity { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Ampacity As Long 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property long long Ampacity { 	long long get (); } ``` |

# See Also

WireSize Class

Autodesk.Revit.DB.Electrical Namespace

#### MappedWidthDiameter Property

---

|  |
| --- |
| FabricationPartSizeMap Class   See Also |

The mapped size for the width or diameter of the straight.

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.2

# Syntax

| C# |
| --- |
| ``` public double MappedWidthDiameter { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property MappedWidthDiameter As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double MappedWidthDiameter { 	double get (); 	void set (double value); } ``` |

# See Also

FabricationPartSizeMap Class

Autodesk.Revit.DB.Fabrication Namespace

#### CantMoveFrozenInstance Property

---

|  |
| --- |
| BuiltInFailures FamilyFailures Class   See Also |

A family instance placed on a curved surface of a linked file can't be moved while the link is unloaded. To move the instance, reload the link or rehost the instance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CantMoveFrozenInstance { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CantMoveFrozenInstance As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CantMoveFrozenInstance { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FamilyFailures Class

Autodesk.Revit.DB Namespace

#### Cmh Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol CMH, indicating unit Cubic meters per hour.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Cmh { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Cmh As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Cmh { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidRungSpace Method

---

|  |
| --- |
| CableTray Class   See Also |

Identifies if the input rung space is valid.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsValidRungSpace( 	double rungSpace ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsValidRungSpace ( _ 	rungSpace As Double _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsValidRungSpace( 	double rungSpace ) ``` |

#### Parameters

rungSpace
:   Type:  System Double
     The rung space to check.

#### Return Value

True if the value is acceptable, false otherwise.

# Remarks

rung space should be at least equal to or larger than rang width which is 1 inch.

# See Also

CableTray Class

Autodesk.Revit.DB.Electrical Namespace

#### RoomDesignLightingLoadPerAreaParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Specified Lighting Load per area"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoomDesignLightingLoadPerAreaParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomDesignLightingLoadPerAreaParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoomDesignLightingLoadPerAreaParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LooseLabeledDimensionRegenFailure Property

---

|  |
| --- |
| BuiltInFailures DimensionFailures Class   See Also |

Failed to Regenerate Family

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId LooseLabeledDimensionRegenFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LooseLabeledDimensionRegenFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ LooseLabeledDimensionRegenFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DimensionFailures Class

Autodesk.Revit.DB Namespace

#### RoomUpperOffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Limit Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoomUpperOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomUpperOffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoomUpperOffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Mullion Class

---

|  |
| --- |
| Members   See Also |

Represents a CurtainGrid within Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class Mullion : FamilyInstance ``` |

| Visual Basic |
| --- |
| ``` Public Class Mullion _ 	Inherits FamilyInstance ``` |

| Visual C++ |
| --- |
| ``` public ref class Mullion : public FamilyInstance ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB Instance
  Autodesk.Revit.DB FamilyInstance
  Autodesk.Revit.DB Mullion

# See Also

Mullion Members

Autodesk.Revit.DB Namespace

#### RoomOutdoorAirflowParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Outdoor Airflow"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoomOutdoorAirflowParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomOutdoorAirflowParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoomOutdoorAirflowParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CheckConstructionSetElement Method

---

|  |
| --- |
| EnergyDataSettings Class   See Also |

Checks that the construction set ElementId is acceptable.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool CheckConstructionSetElement( 	ElementId constructionSetElementId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function CheckConstructionSetElement ( _ 	constructionSetElementId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CheckConstructionSetElement( 	ElementId^ constructionSetElementId ) ``` |

#### Parameters

constructionSetElementId
:   Type:  Autodesk.Revit.DB ElementId
     The construction set ElementId to be checked.

#### Return Value

True if the construction set ElementId is a valid construction set element, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### CannotConvertToDouble Property

---

|  |
| --- |
| BuiltInFailures ConversionFailures Class   See Also |

Cannot convert '[Text] ' to double value

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotConvertToDouble { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotConvertToDouble As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotConvertToDouble { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ConversionFailures Class

Autodesk.Revit.DB Namespace

#### DontEditNestedGroup Property

---

|  |
| --- |
| BuiltInFailures GroupFailures Class   See Also |

Cannot edit nested Groups while inside Edit Group mode for its host Group. To edit the nested Group finish editing all Groups. Use the Tab key to select the nested Group and edit it directly.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DontEditNestedGroup { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DontEditNestedGroup As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DontEditNestedGroup { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GroupFailures Class

Autodesk.Revit.DB Namespace

#### BeforeSaveToCentral Property

---

|  |
| --- |
| DocumentSaveToLocalProgressChangedEventArgs Class   See Also |

True if the "save to local" operation is occurring before "save to central"; false if after.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public bool BeforeSaveToCentral { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property BeforeSaveToCentral As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool BeforeSaveToCentral { 	bool get (); } ``` |

# See Also

DocumentSaveToLocalProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### SteelElemPlateWeight Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Weight"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SteelElemPlateWeight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElemPlateWeight As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SteelElemPlateWeight { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ScheduleGroupParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Sorting/Grouping"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ScheduleGroupParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ScheduleGroupParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ScheduleGroupParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### HeatingCoilType Property

---

|  |
| --- |
| AirSystemData Class   See Also |

The heating coil type. Note this property change would reset the heating water loop.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public AirHeatingCoilType HeatingCoilType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property HeatingCoilType As AirHeatingCoilType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property AirHeatingCoilType HeatingCoilType { 	AirHeatingCoilType get (); 	void set (AirHeatingCoilType value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

AirSystemData Class

Autodesk.Revit.DB.Mechanical Namespace

#### PhaseDemolished Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Phase Demolished"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PhaseDemolished { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PhaseDemolished As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PhaseDemolished { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Current Property

---

|  |
| --- |
| ReferenceArrayIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

ReferenceArrayIterator Class

Autodesk.Revit.DB Namespace

#### ReinforcementCover Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Reinforcement Cover, in discipline Structural.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ReinforcementCover { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ReinforcementCover As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ReinforcementCover { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### GetTypeName Method

---

|  |
| --- |
| AssetProperty Class   See Also |

Get the name of the AssetProperty

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static string GetTypeName( 	AssetPropertyType type ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetTypeName ( _ 	type As AssetPropertyType _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: static String^ GetTypeName( 	AssetPropertyType type ) ``` |

#### Parameters

type
:   Type:  Autodesk.Revit.DB.Visual AssetPropertyType

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when type is AssetPropertyType::Unknown. |

# See Also

AssetProperty Class

Autodesk.Revit.DB.Visual Namespace

#### SetOpenWorksetsConfiguration Method

---

|  |
| --- |
| OpenOptions Class   Example   See Also |

Sets the object used to configure the worksets to open when the model is opened.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetOpenWorksetsConfiguration( 	WorksetConfiguration openConfiguration ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetOpenWorksetsConfiguration ( _ 	openConfiguration As WorksetConfiguration _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetOpenWorksetsConfiguration( 	WorksetConfiguration^ openConfiguration ) ``` |

#### Parameters

openConfiguration
:   Type:  Autodesk.Revit.DB WorksetConfiguration
     The options. If    a null reference (  Nothing  in Visual Basic)  , all user-created worksets will be opened.

# Remarks

These options are ignored for non-workshared models.

# Examples

 Copy  C#

```
Document OpenDocumentWithWorksets(Application app, ModelPath projectPath)
{
    Document doc = null;
    try
    {
        // Get info on all the user worksets in the project prior to opening
        IList<WorksetPreview> worksets = WorksharingUtils.GetUserWorksetInfo(projectPath);
        IList<WorksetId> worksetIds = new List<WorksetId>();
        // Find two predetermined worksets
        foreach (WorksetPreview worksetPrev in worksets)
        {
            if (worksetPrev.Name.CompareTo("Workset1") == 0 ||
                worksetPrev.Name.CompareTo("Workset2") == 0)
            {
                worksetIds.Add(worksetPrev.Id);
            }
        }

        OpenOptions openOptions = new OpenOptions();
        // Setup config to close all worksets by default
        WorksetConfiguration openConfig = new WorksetConfiguration(WorksetConfigurationOption.CloseAllWorksets);
        // Set list of worksets for opening
        openConfig.Open(worksetIds);
        openOptions.SetOpenWorksetsConfiguration(openConfig);
        doc = app.OpenDocumentFile(projectPath, openOptions);
    }
    catch (Exception e)
    {
        TaskDialog.Show("Open File Failed", e.Message);
    }

    return doc;
}
```

 Copy  VB.NET

```
Private Function OpenDocumentWithWorksets(app As Application, projectPath As ModelPath) As Document
    Dim doc As Document = Nothing
    Try
        ' Get info on all the user worksets in the project prior to opening
        Dim worksets As IList(Of WorksetPreview) = WorksharingUtils.GetUserWorksetInfo(projectPath)
        Dim worksetIds As IList(Of WorksetId) = New List(Of WorksetId)()
        ' Find two predetermined worksets
        For Each worksetPrev As WorksetPreview In worksets
            If worksetPrev.Name.CompareTo("Workset1") = 0 OrElse worksetPrev.Name.CompareTo("Workset2") = 0 Then
                worksetIds.Add(worksetPrev.Id)
            End If
        Next

        Dim openOptions As New OpenOptions()
        ' Setup config to close all worksets by default
        Dim openConfig As New WorksetConfiguration(WorksetConfigurationOption.CloseAllWorksets)
        ' Set list of worksets for opening
        openConfig.Open(worksetIds)
        openOptions.SetOpenWorksetsConfiguration(openConfig)
        doc = app.OpenDocumentFile(projectPath, openOptions)
    Catch e As Exception
        TaskDialog.Show("Open File Failed", e.Message)
    End Try

    Return doc
End Function
```

# See Also

OpenOptions Class

Autodesk.Revit.DB Namespace

#### WallSweepInfo Constructor (WallSweepType, Boolean)

---

|  |
| --- |
| WallSweepInfo Class   See Also |

Constructs a new WallSweepInfo instance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public WallSweepInfo( 	WallSweepType type, 	bool vertical ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	type As WallSweepType, _ 	vertical As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: WallSweepInfo( 	WallSweepType type,  	bool vertical ) ``` |

#### Parameters

type
:   Type:  Autodesk.Revit.DB WallSweepType
     The type of the WallSweepInfo instance.

vertical
:   Type:  System Boolean
     True to construct a vertical wall sweep, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

WallSweepInfo Class

WallSweepInfo Overload

Autodesk.Revit.DB Namespace

#### Insulation Property

---

|  |
| --- |
| WireType Class   See Also |

The insulation type.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public InsulationType Insulation { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Insulation As InsulationType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property InsulationType^ Insulation { 	InsulationType^ get (); 	void set (InsulationType^ value); } ``` |

# See Also

WireType Class

Autodesk.Revit.DB.Electrical Namespace

#### IsValidObject Property

---

|  |
| --- |
| PolymeshFacet Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

This property is always True for a polymesh facet.

# See Also

PolymeshFacet Class

Autodesk.Revit.DB Namespace

#### LessThanTwoBars Property

---

|  |
| --- |
| BuiltInFailures RebarSystemFailures Class   See Also |

Each reinforcement direction requires at least 2 bars. Please increase the number of bars.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId LessThanTwoBars { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LessThanTwoBars As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ LessThanTwoBars { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarSystemFailures Class

Autodesk.Revit.DB Namespace

#### BorderRightLineStyle Property

---

|  |
| --- |
| TableCellStyle Class   See Also |

The element id (GraphicsStyle element) for the right line of the cell border.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public ElementId BorderRightLineStyle { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BorderRightLineStyle As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ BorderRightLineStyle { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

TableCellStyle Class

Autodesk.Revit.DB Namespace

#### DollarPerW Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol $/W, indicating unit Cost per watt.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DollarPerW { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DollarPerW As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DollarPerW { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| MultiReferenceAnnotationOptions Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

MultiReferenceAnnotationOptions Class

Autodesk.Revit.DB Namespace

#### DoubleParameterValue Constructor

---

|  |
| --- |
| DoubleParameterValue Class   See Also |

Default constructor

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016 Subscription Update

# Syntax

| C# |
| --- |
| ``` public DoubleParameterValue() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: DoubleParameterValue() ``` |

# See Also

DoubleParameterValue Class

DoubleParameterValue Overload

Autodesk.Revit.DB Namespace

#### LossFactor Property

---

|  |
| --- |
| BasicLossFactor Class   See Also |

The loss factor.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double LossFactor { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LossFactor As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double LossFactor { 	double get (); 	void set (double value); } ``` |

#### Field Value

The loss factor as a numerical value between 0.0 and 4.0

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The loss factor is not valid because it is not between 0.0 and 4.0. |

# See Also

BasicLossFactor Class

Autodesk.Revit.DB.Lighting Namespace

#### OpeningNegativeHeight Property

---

|  |
| --- |
| BuiltInFailures OpeningFailures Class   See Also |

The top of the Opening is lower than the bottom of the Opening or coincident with it.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId OpeningNegativeHeight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property OpeningNegativeHeight As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ OpeningNegativeHeight { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures OpeningFailures Class

Autodesk.Revit.DB Namespace

#### FamilyNamePseudoParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Family"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FamilyNamePseudoParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FamilyNamePseudoParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FamilyNamePseudoParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RebarShapeImage Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Shape Image"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarShapeImage { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarShapeImage As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarShapeImage { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Cancel Method

---

|  |
| --- |
| RevitAPIPreEventArgs Class   See Also |

When the event is cancellable, may call the Cancel() method to cancel it.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public void Cancel() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Cancel ``` |

| Visual C++ |
| --- |
| ``` public: void Cancel() ``` |

# Remarks

Not every event is cancellable. Whether or not an event may be cancelled is indicated by IsCancellable() method.

# See Also

RevitAPIPreEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### CanTotal Method

---

|  |
| --- |
| ScheduleField Class   See Also |

Indicates if totals can be enabled for this field.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool CanTotal() ``` |

| Visual Basic |
| --- |
| ``` Public Function CanTotal As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanTotal() ``` |

#### Return Value

True if this field can be totaled, false otherwise.

# See Also

ScheduleField Class

Autodesk.Revit.DB Namespace

#### Support Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Supports"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Support { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Support As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Support { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### VisGraphicsWorksets Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"V/G Overrides Worksets"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId VisGraphicsWorksets { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property VisGraphicsWorksets As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ VisGraphicsWorksets { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SteelElementInvisibleInCurrentLevelOfDetailWarn Property

---

|  |
| --- |
| BuiltInFailures SteelElementsFailures Class   See Also |

The created elements are only visible in Detail Level: Fine.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SteelElementInvisibleInCurrentLevelOfDetailWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElementInvisibleInCurrentLevelOfDetailWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SteelElementInvisibleInCurrentLevelOfDetailWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SteelElementsFailures Class

Autodesk.Revit.DB Namespace

#### IntegerRange Class

---

|  |
| --- |
| Members   See Also |

A class to define a range of a sequence of consecutive integer numbers

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public class IntegerRange : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class IntegerRange _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class IntegerRange : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB IntegerRange

# See Also

IntegerRange Members

Autodesk.Revit.DB Namespace

#### FabricParamCutOverallLength Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Cut Overall Length": Provides a real sheet Length after definition

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FabricParamCutOverallLength { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricParamCutOverallLength As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FabricParamCutOverallLength { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AllSlotsOnPanelOccupied Property

---

|  |
| --- |
| BuiltInFailures ElectricalFailures Class   See Also |

All slots on panel: [Panel Name] are occupied. Some circuits will be disconnected from this panel.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId AllSlotsOnPanelOccupied { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AllSlotsOnPanelOccupied As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ AllSlotsOnPanelOccupied { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElectricalFailures Class

Autodesk.Revit.DB Namespace

#### CreateRibbonTab Method

---

|  |
| --- |
| ApplicationEntryPoint Class   See Also |

**Namespace:**   Autodesk.Revit.UI.Macros
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override void CreateRibbonTab( 	string tabName ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Sub CreateRibbonTab ( _ 	tabName As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void CreateRibbonTab( 	String^ tabName ) override ``` |

#### Parameters

tabName
:   Type:  System String

# See Also

ApplicationEntryPoint Class

Autodesk.Revit.UI.Macros Namespace

#### AddReferencePlane Method (Plane, BoundingBoxUV, DirectShapeReferenceOptions)

---

|  |
| --- |
| DirectShapeType Class   See Also |

Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void AddReferencePlane( 	Plane refPlane, 	BoundingBoxUV boundingBoxUV, 	DirectShapeReferenceOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddReferencePlane ( _ 	refPlane As Plane, _ 	boundingBoxUV As BoundingBoxUV, _ 	options As DirectShapeReferenceOptions _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddReferencePlane( 	Plane^ refPlane,  	BoundingBoxUV^ boundingBoxUV,  	DirectShapeReferenceOptions^ options ) ``` |

#### Parameters

refPlane
:   Type:  Autodesk.Revit.DB Plane
     The geometry of the new reference plane.

boundingBoxUV
:   Type:  Autodesk.Revit.DB BoundingBoxUV
     If boundingBoxUV is set, the resulting reference plane that is added to the DirectShapeType will be displayed with those bounds. Note that the specified bounds must not be degenerate. If boundingBoxUV is not set, reasonable bounds are automatically calculated and applied to the input plane. The automatic bounds are based on the host direct shape's geometry.

options
:   Type:  Autodesk.Revit.DB DirectShapeReferenceOptions
     The options that are used to configure the new reference plane.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | boundingBoxUV cannot be used as a BoundingBoxUV for the reference plane surface. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DirectShapeType Class

AddReferencePlane Overload

Autodesk.Revit.DB Namespace

#### IsPipingSystemTypeId Method

---

|  |
| --- |
| FlexPipe Class   See Also |

Checks if given type is valid piping system type.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static bool IsPipingSystemTypeId( 	Document document, 	ElementId systemTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsPipingSystemTypeId ( _ 	document As Document, _ 	systemTypeId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsPipingSystemTypeId( 	Document^ document,  	ElementId^ systemTypeId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

systemTypeId
:   Type:  Autodesk.Revit.DB ElementId
     ElementId of the piping system type to check.

#### Return Value

True if the given systemTypeId is the piping system type, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FlexPipe Class

Autodesk.Revit.DB.Plumbing Namespace

#### ResetSupportPosition Method

---

|  |
| --- |
| Railing Class   See Also |

Resets the continuous rails support subelements position data.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void ResetSupportPosition() ``` |

| Visual Basic |
| --- |
| ``` Public Sub ResetSupportPosition ``` |

| Visual C++ |
| --- |
| ``` public: void ResetSupportPosition() ``` |

# See Also

Railing Class

Autodesk.Revit.DB.Architecture Namespace

#### CurveLoopReferencesOnProfile Property

---

|  |
| --- |
| Form Class   See Also |

The curve references in certain curve loop, specified by profile index and curve loop index.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ReferenceArray this[ 	int profileIndex, 	int curveLoopIndex ] { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property CurveLoopReferencesOnProfile ( _ 	profileIndex As Integer, _ 	curveLoopIndex As Integer _ ) As ReferenceArray 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ReferenceArray^ CurveLoopReferencesOnProfile[int profileIndex, int curveLoopIndex] { 	ReferenceArray^ get (int profileIndex, int curveLoopIndex); } ``` |

#### Parameters

profileIndex
:   Type:  System Int32
     Index to specify the profile, should be within 0 and (ProfileCount - 1).

curveLoopIndex
:   Type:  System Int32
     Index to specify the curve loop, should be within 0 and (CurveLoopCount - 1).

# See Also

Form Class

Autodesk.Revit.DB Namespace

#### ExecuteBooleanOperation Method

---

|  |
| --- |
| BooleanOperationsUtils Class   Example   See Also |

Perform a boolean geometric operation between two solids, and return a new solid to represent the result.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static Solid ExecuteBooleanOperation( 	Solid solid0, 	Solid solid1, 	BooleanOperationsType booleanType ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ExecuteBooleanOperation ( _ 	solid0 As Solid, _ 	solid1 As Solid, _ 	booleanType As BooleanOperationsType _ ) As Solid ``` |

| Visual C++ |
| --- |
| ``` public: static Solid^ ExecuteBooleanOperation( 	Solid^ solid0,  	Solid^ solid1,  	BooleanOperationsType booleanType ) ``` |

#### Parameters

solid0
:   Type:  Autodesk.Revit.DB Solid
     The first solid object. A copy will be taken of the input object, so any solid whether obtained from a Revit element or not would be accepted.

solid1
:   Type:  Autodesk.Revit.DB Solid
     The second solid object. A copy will be taken of the input object, so any solid whether obtained from a Revit element or not would be accepted.

booleanType
:   Type:  Autodesk.Revit.DB BooleanOperationsType
     boolean operation type.

#### Return Value

The result geometry.

# Examples

 Copy  C#

```
private void ComputeIntersectionVolume(Solid solidA, Solid solidB)
{
    Solid intersection = BooleanOperationsUtils.ExecuteBooleanOperation(solidA, solidB, BooleanOperationsType.Intersect);
    double volumeOfIntersection = intersection.Volume;
}
```

 Copy  VB.NET

```
Private Sub ComputeIntersectionVolume(solidA As Solid, solidB As Solid)
    Dim intersection As Solid = BooleanOperationsUtils.ExecuteBooleanOperation(solidA, solidB, BooleanOperationsType.Intersect)
    Dim volumeOfIntersection As Double = intersection.Volume
End Sub
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | Failed to perform the Boolean operation for the two solids. This may be due to geometric inaccuracies in the solids, such as slightly misaligned faces or edges. If so, eliminating the inaccuracies by making sure the solids are accurately aligned may solve the problem. This also may be due to one or both solids having complexities such as more than two faces geometrically meeting along a single edge, or two coincident edges, etc. Eliminating such conditions, or performing a sequence of Boolean operations in an order that avoids such conditions, may solve the problem. |

# See Also

BooleanOperationsUtils Class

Autodesk.Revit.DB Namespace

#### UniformatCode Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Assembly Code"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId UniformatCode { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property UniformatCode As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ UniformatCode { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ExecuteService Method (Guid, IExternalData)

---

|  |
| --- |
| ExternalServiceRegistry Class   See Also |

Execute a service independently of any document.

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static ExternalServiceResult ExecuteService( 	Guid executionKey, 	IExternalData data ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ExecuteService ( _ 	executionKey As Guid, _ 	data As IExternalData _ ) As ExternalServiceResult ``` |

| Visual C++ |
| --- |
| ``` public: static ExternalServiceResult ExecuteService( 	Guid executionKey,  	IExternalData^ data ) ``` |

#### Parameters

executionKey
:   Type:  System Guid
     Access key of the service to be executed. The key is not the same as the service's Id. It is the value that was returned to the caller who registered the service.

data
:   Type:  Autodesk.Revit.DB.ExternalService IExternalData
     The associated data. The type is defined by the service.

#### Return Value

The result of executing the external service.

# Remarks

Execution of a service should be invoked only by the application that registered the service. The execution will use the currently active server (or servers in the case of a multi-server service).

This method does not take a document as one of its arguments and therefore it is not intended for executions of recordable services that may modify documents. If the service (recordable) or its server(s) is expected to modify documents, the other ExecuteService method -- the one that takes a document as one of its arguments -- is supposed to be used.

Non-recordable services are free to modify documents during this ExecuteService call, because activities of non-recordable services are not recorded; the changes those services made are assumed to be independent of the presence of the service and/or its servers.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The execution key is either invalid or of a service that is not registered. To execute a service, the key returned by RegisterService method must be used. -or- The execution key is of a service that is already being executed. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExternalServiceRegistry Class

ExecuteService Overload

Autodesk.Revit.DB.ExternalService Namespace

#### EnableTemporaryViewPropertiesMode Method

---

|  |
| --- |
| View Class   See Also |

Turns Temporary View Properties mode on or off. In this mode, any changes made to the view are temporary and will be discarded once the mode is disabled.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool EnableTemporaryViewPropertiesMode( 	ElementId viewTemplateId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function EnableTemporaryViewPropertiesMode ( _ 	viewTemplateId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool EnableTemporaryViewPropertiesMode( 	ElementId^ viewTemplateId ) ``` |

#### Parameters

viewTemplateId
:   Type:  Autodesk.Revit.DB ElementId
     If the id of a view template is provided, Temporary View Properties mode is turned on and the settings from the template are applied to the view for the duration of the mode. If the id provided is not that of a template but the id of the view itself, Temporary View Properties mode is turned on without any changes to the view. If ElementId.InvalidElementId is provided, Temporary View Properties mode is turned off.

#### Return Value

Returns true when the view template provided by viewTemplateId was applied and Temporary View Properties was successfully turned on. Also returns true if ElementId.InvalidElementId was provided as input and Temporary View Properties was successfully turned off.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | View cannot use Temporary View Properties mode in current state. |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### SteelElemHoleDepthOfBoltHead Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Depth of bolt head"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SteelElemHoleDepthOfBoltHead { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElemHoleDepthOfBoltHead As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SteelElemHoleDepthOfBoltHead { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Units Class

---

|  |
| --- |
| Members   See Also |

A document's default settings for formatting numbers with units.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class Units : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class Units _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class Units : IDisposable ``` |

# Remarks

The Units class represents a document's default settings for formatting numbers with units as strings. It contains a  FormatOptions  object for each unit type as well as settings related to decimal symbol and digit grouping.

The Units class stores a FormatOptions object for every valid unit type, but not all of them can be directly modified. Some, like UT\_Number and UT\_SiteAngle, have fixed definitions. Others have definitions which are automatically derived from other unit types. For example, UT\_SheetLength is derived from UT\_Length and UT\_ForceScale is derived from UT\_Force. See  IsModifiableUnitType()  and  GetModifiableUnitTypes()  .

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Units

# See Also

Units Members

Autodesk.Revit.DB Namespace

#### FlexPipeType Class

---

|  |
| --- |
| Members   See Also |

A flex pipe type in the Autodesk Revit MEP product.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class FlexPipeType : MEPCurveType ``` |

| Visual Basic |
| --- |
| ``` Public Class FlexPipeType _ 	Inherits MEPCurveType ``` |

| Visual C++ |
| --- |
| ``` public ref class FlexPipeType : public MEPCurveType ``` |

# Remarks

The flex pipe type is only available in the Autodesk Revit MEP product.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB HostObjAttributes
  Autodesk.Revit.DB MEPCurveType
  Autodesk.Revit.DB.Plumbing FlexPipeType

# See Also

FlexPipeType Members

Autodesk.Revit.DB.Plumbing Namespace

#### YoungModulus Property

---

|  |
| --- |
| StructuralAsset Class   See Also |

The Young's modulus of the asset.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public XYZ YoungModulus { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property YoungModulus As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ YoungModulus { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Remarks

This property cannot be used to set the Young's modulus for wood-based and isotropic materials. For such assets, use setYoungModulus instead. The value is in Newtons per foot meter (N/(ft Â· m)).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions InapplicableDataException | When setting this property: the material type is wood. -or- When setting this property: the behavior is isotropic. |

# See Also

StructuralAsset Class

Autodesk.Revit.DB Namespace

#### GetHookTangentLength Method

---

|  |
| --- |
| RebarBarType Class   See Also |

Identifies the hook tangent length for a hook type

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public double GetHookTangentLength( 	ElementId hookId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetHookTangentLength ( _ 	hookId As ElementId _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetHookTangentLength( 	ElementId^ hookId ) ``` |

#### Parameters

hookId
:   Type:  Autodesk.Revit.DB ElementId
     id of the hook type

#### Return Value

The hook tangent length for a hook type

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | the rebar hook type id hookId is not valid |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RebarBarType Class

Autodesk.Revit.DB.Structure Namespace

#### Evaluate Method

---

|  |
| --- |
| FormulaManager Class   See Also |

Evaluates value of the formula

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static string Evaluate( 	ElementId parameterId, 	Document document, 	string formula ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Evaluate ( _ 	parameterId As ElementId, _ 	document As Document, _ 	formula As String _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: static String^ Evaluate( 	ElementId^ parameterId,  	Document^ document,  	String^ formula ) ``` |

#### Parameters

parameterId
:   Type:  Autodesk.Revit.DB ElementId

document
:   Type:  Autodesk.Revit.DB Document

formula
:   Type:  System String

# Remarks

It evaluates formula using list of global or family parameters depends on document type.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FormulaManager Class

Autodesk.Revit.DB Namespace

#### IsValidSubelementReference Method

---

|  |
| --- |
| Subelement Class   See Also |

Checks if given Reference identifies either a valid element or subelement.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static bool IsValidSubelementReference( 	Document aDoc, 	Reference reference ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidSubelementReference ( _ 	aDoc As Document, _ 	reference As Reference _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidSubelementReference( 	Document^ aDoc,  	Reference^ reference ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     The document.

reference
:   Type:  Autodesk.Revit.DB Reference
     The reference that identifies an element or subelement.

#### Return Value

True if %reference% identifies a valid element or subelement, false otherwise.

# Remarks

A reference to an element or subelement in a linked document is acceptable.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Subelement Class

Autodesk.Revit.DB Namespace

#### CoverOffset Property

---

|  |
| --- |
| FabricSheet Class   See Also |

The additional cover offset of the Fabric Sheet.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public double CoverOffset { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CoverOffset As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double CoverOffset { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The given value for coverOffset is not a number -or- When setting this property: coverOffset is greater then the host thickness. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for coverOffset must be between 0 and 30000 feet. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: |

# See Also

FabricSheet Class

Autodesk.Revit.DB.Structure Namespace

#### Create Method (IList(XYZ), Boolean)

---

|  |
| --- |
| HermiteSpline Class   See Also |

Creates a Hermite spline with default tangency at its endpoints.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static HermiteSpline Create( 	IList<XYZ> controlPoints, 	bool periodic ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	controlPoints As IList(Of XYZ), _ 	periodic As Boolean _ ) As HermiteSpline ``` |

| Visual C++ |
| --- |
| ``` public: static HermiteSpline^ Create( 	IList<XYZ^>^ controlPoints,  	bool periodic ) ``` |

#### Parameters

controlPoints
:   Type:  System.Collections.Generic IList   XYZ
     The control points of the Hermite spline.

periodic
:   Type:  System Boolean
     True if the Hermite spline is to be periodic, false otherwise.

#### Return Value

The new HermiteSpline object.

# Remarks

The tangents at the ends of the spline are computed from the control points.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The control points array is invalid, because it doesn't contain the minimum number of points (2). |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was NULL |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance). |
| Autodesk.Revit.Exceptions InvalidOperationException | Unable to construct valid HermiteSpline from given inputs. |

# See Also

HermiteSpline Class

Create Overload

Autodesk.Revit.DB Namespace

#### DollarPerFtSup2 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol $/ftÂ², indicating unit Cost per square foot.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DollarPerFtSup2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DollarPerFtSup2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DollarPerFtSup2 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### CannotHaveArcs Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

Sorry, we can't use arcs here.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotHaveArcs { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotHaveArcs As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotHaveArcs { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### FlangeThickness Property

---

|  |
| --- |
| StructuralSectionHotRolled Class   See Also |

Flange Thickness.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public double FlangeThickness { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FlangeThickness As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double FlangeThickness { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionHotRolled Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### ReverseIterator Method

---

|  |
| --- |
| WireSet Class   See Also |

Retrieve a backward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual WireSetIterator ReverseIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ReverseIterator As WireSetIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual WireSetIterator^ ReverseIterator() ``` |

#### Return Value

Returns a backward moving iterator to the set.

# See Also

WireSet Class

Autodesk.Revit.DB.Electrical Namespace

#### Prefix Property

---

|  |
| --- |
| TableCellCombinedParameterData Class   See Also |

The prefix for this parameter

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public string Prefix { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Prefix As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Prefix { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

TableCellCombinedParameterData Class

Autodesk.Revit.DB Namespace

#### DocumentCreated Event

---

|  |
| --- |
| ControlledApplication Class   See Also |

Subscribe to the DocumentCreated event to be notified immediately after Revit has finished creating a new document.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public event EventHandler<DocumentCreatedEventArgs> DocumentCreated ``` |

| Visual Basic |
| --- |
| ``` Public Event DocumentCreated As EventHandler(Of DocumentCreatedEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<DocumentCreatedEventArgs^>^ DocumentCreated { 	void add (EventHandler<DocumentCreatedEventArgs^>^ value); 	void remove (EventHandler<DocumentCreatedEventArgs^>^ value); } ``` |

# Remarks

This event is raised immediately after Revit has finished creating a new document. It is raised even when document creation failed or was cancelled (during DocumentCreating event).

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.

Check the 'Status' field in event's argument to see whether the action itself was successful or not. This event is not cancellable, for the process of document creation has already been finished.

If the action was not successful, the document may not be modified and new transactions may not be started.

The following API functions are not available for the current document during this event:

* Close  and similar overloads.

Exception  InvalidOperationException  will be thrown if any of the above methods is called during this event.

# See Also

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace

#### SteelElemPatternTotalLength Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Length on side 1"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SteelElemPatternTotalLength { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElemPatternTotalLength As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SteelElemPatternTotalLength { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetRebarUpdateCurvesData Method

---

|  |
| --- |
| RebarCurvesData Class   See Also |

Gets a class that contains information used as input and output for rebar free form calculation.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public RebarUpdateCurvesData GetRebarUpdateCurvesData() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetRebarUpdateCurvesData As RebarUpdateCurvesData ``` |

| Visual C++ |
| --- |
| ``` public: RebarUpdateCurvesData^ GetRebarUpdateCurvesData() ``` |

#### Return Value

Gets a class that contains information used as input and output for rebar free form calculation.

# See Also

RebarCurvesData Class

Autodesk.Revit.DB.Structure Namespace

#### GetDefaultHookAngle Method

---

|  |
| --- |
| RebarShape Class   See Also |

Get the hook angle, expressed as an integral number of degrees (common values are 0, 90, 135, and 180).

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public int GetDefaultHookAngle( 	int index ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetDefaultHookAngle ( _ 	index As Integer _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int GetDefaultHookAngle( 	int index ) ``` |

#### Parameters

index
:   Type:  System Int32
     0 for the starting hook, 1 for the ending hook.

# Remarks

Replaces the method GetHookAngle() from prior releases.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | index must be 0 or 1. |

# See Also

RebarShape Class

Autodesk.Revit.DB.Structure Namespace

#### BaseLoadOn Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all the possible power load use types for a space object.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum BaseLoadOn ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration BaseLoadOn ``` |

| Visual C++ |
| --- |
| ``` public enum class BaseLoadOn ``` |

# Members

| Member name | Description |
| --- | --- |
| kUseDefaultLoad | Return BaseLoadOn is UseDefaultLoad. Obsoleted from 2018, use kBySpaceType instead. |
| kBySpaceType | Return BaseLoadOn is BySpaceType. |
| kUseEnteredLoad | Return BaseLoadOn is UseEnteredLoad. |
| kUseCalculatedLoad | Return BaseLoadOn is UseCalculatedLoad. |
| kUseActualLoad | Return BaseLoadOn is UseActualLoad. |
| kNoOfBaseLoadOnMethods | Return BaseLoadOn is NoOfBaseLoadOnMethods. |

# See Also

Autodesk.Revit.DB Namespace

#### Equals Method

---

|  |
| --- |
| ForgeTypeId Class   See Also |

Determines whether this ForgeTypeId is equal to another.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public override bool Equals( 	Object other ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Function Equals ( _ 	other As Object _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Equals( 	Object^ other ) override ``` |

#### Parameters

other
:   Type:  System Object
     The ForgeTypeId with which to compare this ForgeTypeId.

#### Return Value

True if the given ForgeTypeId is equal to this one, or false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was NULL |

# See Also

ForgeTypeId Class

Autodesk.Revit.DB Namespace

#### DisplacementPath Class

---

|  |
| --- |
| Members   See Also |

A view-specific annotation related to a DisplacementElement.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class DisplacementPath : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class DisplacementPath _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class DisplacementPath : public Element ``` |

# Remarks

The DisplacementPath is anchored to the DisplacementElement by a reference to a point on an edge of a source element of the DisplacementElement. It is represented by a single line, or a series of jogged lines, originating at the specified point on the displaced element.

The associated DisplacementElement may have a parent DisplacementElement and this parent may have its own parent DisplacementElement, producing a series of ancestors. The terminal point may be the point's original (un-displaced) location, or the corresponding point on any of the intermediate displaced locations corresponding to these ancestor DisplacementElements.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB DisplacementPath

# See Also

DisplacementPath Members

Autodesk.Revit.DB Namespace

#### MoveNext Method

---

|  |
| --- |
| PhaseArrayIterator Class   See Also |

Move the iterator one item forward.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool MoveNext() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function MoveNext As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool MoveNext() ``` |

#### Return Value

Returns True if the iterator was successfully moved forward one item and the Current property will return a valid item. False will be returned it the iterator has reached the end of the array.

#### Implements

 IEnumerator MoveNext

# Remarks

MoveNext must be called before the Current property is valid with a new or Reset iterator in line with the expected behavior of IEnumerator.

# See Also

PhaseArrayIterator Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| AnalysisDisplayColorEntry Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

AnalysisDisplayColorEntry Class

Autodesk.Revit.DB.Analysis Namespace

#### WattsPerSquareFoot Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Watts per square foot.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WattsPerSquareFoot { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WattsPerSquareFoot As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WattsPerSquareFoot { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### HVACLoadType Class

---

|  |
| --- |
| Members   See Also |

The base class for building type and space type.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public class HVACLoadType : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class HVACLoadType _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class HVACLoadType : public Element ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB.Analysis HVACLoadType
  Autodesk.Revit.DB.Analysis HVACLoadBuildingType
  Autodesk.Revit.DB.Analysis HVACLoadSpaceType

# See Also

HVACLoadType Members

Autodesk.Revit.DB.Analysis Namespace

#### CompoundStructureLayer Constructor (Double, MaterialFunctionAssignment, ElementId)

---

|  |
| --- |
| CompoundStructureLayer Class   See Also |

Creates a default compound structure layer based on the given width, function and material element id.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public CompoundStructureLayer( 	double width, 	MaterialFunctionAssignment function, 	ElementId materialId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	width As Double, _ 	function As MaterialFunctionAssignment, _ 	materialId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: CompoundStructureLayer( 	double width,  	MaterialFunctionAssignment function,  	ElementId^ materialId ) ``` |

#### Parameters

width
:   Type:  System Double
     The width of the layer.

function
:   Type:  Autodesk.Revit.DB MaterialFunctionAssignment
     The function of the layer.

materialId
:   Type:  Autodesk.Revit.DB ElementId
     The material element id of the layer.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

CompoundStructureLayer Class

CompoundStructureLayer Overload

Autodesk.Revit.DB Namespace

#### Product Property

---

|  |
| --- |
| Application Class   See Also |

The product type for the current session of Revit.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ProductType Product { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Product As ProductType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ProductType Product { 	ProductType get (); } ``` |

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### NumCurveLoops Property

---

|  |
| --- |
| Path3d Class   See Also |

Get the Number of Curve Loops of Path3d.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int NumCurveLoops { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property NumCurveLoops As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int NumCurveLoops { 	int get (); } ``` |

# Remarks

Returns the Number of Curve Loops of Path3d.

# See Also

Path3d Class

Autodesk.Revit.DB Namespace

#### SpacingNumDivisions Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Number"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpacingNumDivisions { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpacingNumDivisions As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpacingNumDivisions { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### JoulesPerGramDegreeCelsius Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Joules per gram degree Celsius.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId JoulesPerGramDegreeCelsius { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property JoulesPerGramDegreeCelsius As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ JoulesPerGramDegreeCelsius { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### FilterOperatorAndTextString Class

---

|  |
| --- |
| Members   See Also |

An instance of this class holds a filter operator and a text string that denotes the operator in a particular context. For example, the text string for ScheduleFilterType::LessThan may be "is less than" for a filter rule based on a parameter with numerical values or "is below" for a filter rule based on a parameter representing a Level.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public class FilterOperatorAndTextString : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class FilterOperatorAndTextString _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class FilterOperatorAndTextString : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB FilterOperatorAndTextString

# See Also

FilterOperatorAndTextString Members

Autodesk.Revit.DB Namespace

#### Current Property

---

|  |
| --- |
| PaperSourceSetIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

PaperSourceSetIterator Class

Autodesk.Revit.DB Namespace

#### UnboundedHeight Property

---

|  |
| --- |
| Room Class   See Also |

Get the Unbounded Height of the Room.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double UnboundedHeight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property UnboundedHeight As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double UnboundedHeight { 	double get (); } ``` |

# Remarks

This property is used to get the Unbounded Height of the Room.

# See Also

Room Class

Autodesk.Revit.DB.Architecture Namespace

#### HeatTransferCoefficient Property

---

|  |
| --- |
| FamilyThermalProperties Class   See Also |

The heat transfer coefficient value (U-Value). The units are watts per meter-squared kelvin (W/(m^2\*K)).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double HeatTransferCoefficient { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property HeatTransferCoefficient As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double HeatTransferCoefficient { 	double get (); } ``` |

# See Also

FamilyThermalProperties Class

Autodesk.Revit.DB Namespace

#### Create Method (Document, AnalyticalSystemDomain, String)

---

|  |
| --- |
| ZoneEquipment Class   See Also |

Creates a new zone equipment

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` [ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit.")] public static ZoneEquipment Create( 	Document document, 	AnalyticalSystemDomain systemDomain, 	string name ) ``` |

| Visual Basic |
| --- |
| ``` <ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit.")> _ Public Shared Function Create ( _ 	document As Document, _ 	systemDomain As AnalyticalSystemDomain, _ 	name As String _ ) As ZoneEquipment ``` |

| Visual C++ |
| --- |
| ``` [ObsoleteAttribute(L"This method is deprecated in Revit 2023 and may be removed in a later version of Revit.")] public: static ZoneEquipment^ Create( 	Document^ document,  	AnalyticalSystemDomain systemDomain,  	String^ name ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document where the new element will be created.

systemDomain
:   Type:  Autodesk.Revit.DB.Mechanical AnalyticalSystemDomain
     The system domain of zone equipment.

name
:   Type:  System String
     The name of new zone equipment. The actual name may be post-fixed if already exists.

#### Return Value

The newly created zone equipment.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- name is an empty string. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

ZoneEquipment Class

Create Overload

Autodesk.Revit.DB.Mechanical Namespace

#### GetSelectionFilter Method

---

|  |
| --- |
| PointCloudInstance Class   See Also |

Returns the currently active selection filter for this point cloud.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public PointCloudFilter GetSelectionFilter() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSelectionFilter As PointCloudFilter ``` |

| Visual C++ |
| --- |
| ``` public: PointCloudFilter^ GetSelectionFilter() ``` |

#### Return Value

Currently active selection filter or    a null reference (  Nothing  in Visual Basic)  if none is active.

# See Also

PointCloudInstance Class

Autodesk.Revit.DB Namespace

#### IsJoinAllowedAtEnd Method

---

|  |
| --- |
| StructuralFramingUtils Class   See Also |

Identifies if the indicated end of the framing element is allowed to join to others.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static bool IsJoinAllowedAtEnd( 	FamilyInstance familyInstance, 	int end ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsJoinAllowedAtEnd ( _ 	familyInstance As FamilyInstance, _ 	end As Integer _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsJoinAllowedAtEnd( 	FamilyInstance^ familyInstance,  	int end ) ``` |

#### Parameters

familyInstance
:   Type:  Autodesk.Revit.DB FamilyInstance
     The FamilyInstance, which must be of a structural framing category.

end
:   Type:  System Int32
     The index of the end (0 for the start, 1 for the end).

#### Return Value

True if it is allowed to join. False if it is disallowed.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | end must be 0 or 1. |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | The input familyInstance is not of a structural framing category. |

# See Also

StructuralFramingUtils Class

Autodesk.Revit.DB.Structure Namespace

#### CannotChangeUserSketchPlaneError Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

Can't change plane of [Element Name] Sketch.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotChangeUserSketchPlaneError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotChangeUserSketchPlaneError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotChangeUserSketchPlaneError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### RbsPipeInsulationThickness Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Insulation Thickness"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsPipeInsulationThickness { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsPipeInsulationThickness As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsPipeInsulationThickness { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### EdgeEndPoint Constructor (Edge, Int32)

---

|  |
| --- |
| EdgeEndPoint Class   See Also |

Constructs an instance of EdgeEndPoint.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public EdgeEndPoint( 	Edge edge, 	int index ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	edge As Edge, _ 	index As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: EdgeEndPoint( 	Edge^ edge,  	int index ) ``` |

#### Parameters

edge
:   Type:  Autodesk.Revit.DB Edge
     The Edge.

index
:   Type:  System Int32
     Use 0 for the start point, 1 for the end point of an Edge.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The given value for index is not 0 or 1. |

# See Also

EdgeEndPoint Class

EdgeEndPoint Overload

Autodesk.Revit.DB Namespace

#### Intersect Method (Curve)

---

|  |
| --- |
| Curve Class   See Also |

Calculates the intersection of this curve with the specified curve.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public SetComparisonResult Intersect( 	Curve curve ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Intersect ( _ 	curve As Curve _ ) As SetComparisonResult ``` |

| Visual C++ |
| --- |
| ``` public: SetComparisonResult Intersect( 	Curve^ curve ) ``` |

#### Parameters

curve
:   Type:  Autodesk.Revit.DB Curve
     The specified curve to intersect with this curve.

#### Return Value

* SetComparisonResult.Overlap - One or more intersections were encountered.
* SetComparisonResult.Subset - The inputs are parallel lines with only one common intersection point, or the curve used to invoke the intersection check is a line entirely within the unbound line passed as argument curve.
* SetComparisonResult.Superset - The input curve is entirely within the unbound line used to invoke the intersection check.
* SetComparisonResult.Disjoint - There is no intersection found between the two curves.
* SetComparisonResult.Equal - The two curves are identical.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | The specified curve is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions InvalidOperationException | Failed to calculate the intersection. |

# See Also

Curve Class

Intersect Overload

Autodesk.Revit.DB Namespace

#### RbsHvacloadSkylightAreaParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Skylight Area"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsHvacloadSkylightAreaParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsHvacloadSkylightAreaParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsHvacloadSkylightAreaParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### VertexPosition Constructor

---

|  |
| --- |
| VertexPosition Class   See Also |

Constructs the vertex from a point.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public VertexPosition( 	XYZ position ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	position As XYZ _ ) ``` |

| Visual C++ |
| --- |
| ``` public: VertexPosition( 	XYZ^ position ) ``` |

#### Parameters

position
:   Type:  Autodesk.Revit.DB XYZ
     The vertex's position.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

VertexPosition Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### ElectricalSystemType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all the possible electrical system types for a connector object.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum ElectricalSystemType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ElectricalSystemType ``` |

| Visual C++ |
| --- |
| ``` public enum class ElectricalSystemType ``` |

# Members

| Member name | Description |
| --- | --- |
| UndefinedSystemType | Undefined system type |
| Data | Electrical System Type is Data. |
| PowerCircuit | Electrical System Type is PowerCircuit. |
| Telephone | Electrical System Type is Telephone. |
| Security | Electrical System Type is Security |
| FireAlarm | Electrical System Type is FireAlarm |
| NurseCall | System Type is NurseCall. |
| Controls | Electrical System Type is Controls. |
| Communication | Electrical System Type is Communication. |
| PowerBalanced | Electrical System Type is PowerBalanced. |
| PowerUnBalanced | Electrical System Type is PowerUnBalanced. |

# See Also

Autodesk.Revit.DB.Electrical Namespace

#### IsValidObject Property

---

|  |
| --- |
| VertexBuffer Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

VertexBuffer Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### GetConduitSettings Method

---

|  |
| --- |
| ConduitSettings Class   See Also |

Gets the conduit settings of the project.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static ConduitSettings GetConduitSettings( 	Document document ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetConduitSettings ( _ 	document As Document _ ) As ConduitSettings ``` |

| Visual C++ |
| --- |
| ``` public: static ConduitSettings^ GetConduitSettings( 	Document^ document ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

#### Return Value

The conduit settings of the project.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ConduitSettings Class

Autodesk.Revit.DB.Electrical Namespace

#### OmniclassCode Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"OmniClass Number"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId OmniclassCode { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property OmniclassCode As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ OmniclassCode { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TopWebFillet Property

---

|  |
| --- |
| StructuralSectionGeneralT Class   See Also |

Top Web Fillet - fillet radius at the top of web.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public double TopWebFillet { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property TopWebFillet As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double TopWebFillet { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionGeneralT Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### SymbolNameParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Type Name"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SymbolNameParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SymbolNameParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SymbolNameParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CanViewBeDuplicated Method

---

|  |
| --- |
| View Class   See Also |

Identifies if this view can be duplicated.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool CanViewBeDuplicated( 	ViewDuplicateOption duplicateOption ) ``` |

| Visual Basic |
| --- |
| ``` Public Function CanViewBeDuplicated ( _ 	duplicateOption As ViewDuplicateOption _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanViewBeDuplicated( 	ViewDuplicateOption duplicateOption ) ``` |

#### Parameters

duplicateOption
:   Type:  Autodesk.Revit.DB ViewDuplicateOption
     The option to use when duplicating the view.

#### Return Value

True if the view can be duplicated, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### PreserveOverrides Property

---

|  |
| --- |
| CADLinkOptions Class   See Also |

Whether Revit should preserve the link's graphic overrides on reload.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public bool PreserveOverrides { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PreserveOverrides As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool PreserveOverrides { 	bool get (); 	void set (bool value); } ``` |

# See Also

CADLinkOptions Class

Autodesk.Revit.DB Namespace

#### RemoveTemperature Method

---

|  |
| --- |
| FluidType Class   See Also |

Removes a fluid temperature via the temperature value from the set.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void RemoveTemperature( 	double temperature ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub RemoveTemperature ( _ 	temperature As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void RemoveTemperature( 	double temperature ) ``` |

#### Parameters

temperature
:   Type:  System Double
     The temperature value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if the temperature that will be removed doesn't exist in the fluid type or the temperature that will be removed is in use. |

# See Also

FluidType Class

Autodesk.Revit.DB.Plumbing Namespace

#### SetFlags Method (IList(Int32))

---

|  |
| --- |
| ValueAtPointBase Class   See Also |

Independently sets the flags associated to all measurements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void SetFlags( 	IList<int> flags ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetFlags ( _ 	flags As IList(Of Integer) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetFlags( 	IList<int>^ flags ) ``` |

#### Parameters

flags
:   Type:  System.Collections.Generic IList   Int32
     An array of flags values. Each member corresponds to a measurement. Flags values are defined in the enumerated class ValueAtPointFlags and are combined into the int value. Number of measurements is set at creation of SpatialFieldManager in method createSpatialFieldManager.

# Remarks

If you set the array of flags to only contain one value, this flags value will apply to all measurements

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ValueAtPointBase Class

SetFlags Overload

Autodesk.Revit.DB Namespace

#### Empty Method

---

|  |
| --- |
| ForgeTypeId Class   See Also |

Checks if the typeId is an empty string

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public bool Empty() ``` |

| Visual Basic |
| --- |
| ``` Public Function Empty As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool Empty() ``` |

# See Also

ForgeTypeId Class

Autodesk.Revit.DB Namespace

#### NotOneCCWLoop Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

This sketch defines more than one footprint. Make sure the sketch contains only one outermost loop and that there are no loops inside inner loops.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NotOneCCWLoop { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NotOneCCWLoop As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NotOneCCWLoop { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### DistanceBetweenBarsWarning Property

---

|  |
| --- |
| BuiltInFailures RebarCouplerFailures Class   See Also |

This is used to post warning. The distance between the connected ends of the bars exceeds 10 bar diameters.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DistanceBetweenBarsWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DistanceBetweenBarsWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DistanceBetweenBarsWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarCouplerFailures Class

Autodesk.Revit.DB Namespace

#### IsEmpty Property

---

|  |
| --- |
| ElementArray Class   See Also |

Test to see if the array is empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool IsEmpty { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property IsEmpty As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property bool IsEmpty { 	bool get (); } ``` |

# Remarks

If the array is empty then True will be returned, otherwise False.

# See Also

ElementArray Class

Autodesk.Revit.DB Namespace

#### RoomLevelElevs Property

---

|  |
| --- |
| BuiltInFailures RoomFailures Class   See Also |

A [Room]s Upper Limit must be above its Base Level.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RoomLevelElevs { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomLevelElevs As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RoomLevelElevs { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RoomFailures Class

Autodesk.Revit.DB Namespace

#### FabricationPartCannotChangeTypeWarning Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

The selected fitting(s) cannot maintain connections to existing fabrication parts due to size, direction or angle differences. You must manually reconnect the open connections.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabricationPartCannotChangeTypeWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationPartCannotChangeTypeWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabricationPartCannotChangeTypeWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace

#### Size Property

---

|  |
| --- |
| ModelCurveArray Class   See Also |

Returns the number of model curves that are in the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Size { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Size As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property int Size { 	int get (); } ``` |

# See Also

ModelCurveArray Class

Autodesk.Revit.DB Namespace

#### BadClassificationLevel Property

---

|  |
| --- |
| BuiltInFailures KeyBasedTreeEntryFailures Class   See Also |

Level [Level] of Classification [Code] is not an integer from 1 to 5.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BadClassificationLevel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BadClassificationLevel As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BadClassificationLevel { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures KeyBasedTreeEntryFailures Class

Autodesk.Revit.DB Namespace

#### ZoneUseOutsideAirPerAreaParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Use Outside Air Per Area"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ZoneUseOutsideAirPerAreaParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ZoneUseOutsideAirPerAreaParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ZoneUseOutsideAirPerAreaParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### WallSide Enumeration

---

|  |
| --- |
| See Also |

Represents the possible sides of a wall where a sweep or reveal may be attached.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum WallSide ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WallSide ``` |

| Visual C++ |
| --- |
| ``` public enum class WallSide ``` |

# Members

| Member name | Description |
| --- | --- |
| Exterior | The exterior of the wall. |
| Interior | The interior of the wall. |

# See Also

Autodesk.Revit.DB Namespace

#### LoadMomentMy1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"My 1"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadMomentMy1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadMomentMy1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadMomentMy1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FabricSheetMinorSpacing Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Minor Spacing": Minor Spacing

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FabricSheetMinorSpacing { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricSheetMinorSpacing As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FabricSheetMinorSpacing { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsSolidFill Property

---

|  |
| --- |
| FillPattern Class   See Also |

Check if the fill pattern is a solid fill pattern.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsSolidFill { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsSolidFill As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsSolidFill { 	bool get (); } ``` |

# See Also

FillPattern Class

Autodesk.Revit.DB Namespace